Documents/ЗаявкаНаРасходованиеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЗаявкаНаРасходованиеДенежныхСредств</Name>
			<BasedOn>
				<xr:Item>Document.ВозвратТовараОтПокупателя</xr:Item>
				<xr:Item>Document.НачислениеЗарплаты</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровИУслуг</xr:Item>
				<xr:Item>Document.ЗаказДоговор</xr:Item>
				<xr:Item>Document.Замена</xr:Item>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.ЗаявкаНаДоставку</xr:Item>
				<xr:Item>Document.Монтаж</xr:Item>
				<xr:Item>Document.РеализацияТоваровИУслуг</xr:Item>
				<xr:Item>Document.СчетНаОплату</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.ПеремещениеТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредстваКВыплате</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтатусУтвержденияПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыУтвержденияПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖелательнаяДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйУтвердил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПродукции</v8:Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗарплаты</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.Замена</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаДоставку</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТовараОтПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперацииРКО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийРасходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперацииСРС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийСписаниеСРасчетногоСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПлатежа</Name>
					<Comment>Поле 22 "Код"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеречислениеВБюджет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСоставителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодБК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательНомера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательДаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательТипа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПлатежногоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПлатежныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчередностьПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Comment>Вид денежных средств</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВидаДохода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходовПоНачислению</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданПриИспользованииПодразделений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗарплатаСотрудникам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетСотрудника</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УДАЛИТЬ_ВидНачисления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНачислений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаспределениеПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ДенежныеСредстваКВыплате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредстваКВыплате</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаПеремещениеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийРасходныйКассовыйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРасходныйКассовыйОрдер</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВозвратКредита</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПокупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаПодотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗарплатаСотрудникам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инкассация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееСписание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыУтвержденияПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыУтвержденияПлатежей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУтвержден</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявкаНаРасходованиеДенежныхСредств/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда		
		ИнициализироватьСлужебныеРеквизиты();		
	КонецЕсли;
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	ПериодРегистрации = НачалоМесяца(ТекущаяДатаСеанса());
		
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные;
		ВидОперацииРКО = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ОплатаПоставщику;
		ВидОперацииСРС = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ОплатаПоставщику;
		Договор = ДанныеЗаполнения.ДоговорКонтрагента;
		//Комментарий = ДанныеЗаполнения.Комментарий; //#5849
		Контрагент = ДанныеЗаполнения.Контрагент;
		Организация = ДанныеЗаполнения.Организация;
		Основание = ДанныеЗаполнения.Ссылка;
		СуммаДокумента = Документы.ЗаказПоставщику.СуммаКОплате(ДанныеЗаполнения); //ДанныеЗаполнения.СуммаДокумента; //#14377
		ВалютаДокумента = ДанныеЗаполнения.Валюта;
		
		НоваяСтрока = РаспределениеПлатежа.Добавить();
		НоваяСтрока.Документ = ДанныеЗаполнения.Ссылка;
		НоваяСтрока.Сумма = СуммаДокумента;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НачислениеЗарплаты") Тогда
		ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные;
		//Комментарий = ДанныеЗаполнения.Комментарий; //#5849
		СуммаДокумента = ДанныеЗаполнения.Начисление.Итог("Сумма");
		Организация = ДанныеЗаполнения.Организация;
		Основание = ДанныеЗаполнения.Ссылка;
		ВидОперацииРКО = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ЗарплатаСотрудникам;
		ВидОперацииСРС = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотрудникам;
		ПериодРегистрации = ДанныеЗаполнения.ПериодРегистрации;
		Для Каждого ТекСтрокаНачисление Из ДанныеЗаполнения.Начисление Цикл
			НоваяСтрока = ЗарплатаСотрудникам.Добавить();
			НоваяСтрока.Сотрудник = ТекСтрокаНачисление.Сотрудник;
			//НоваяСтрока.УДАЛИТЬ_ВидНачисления = ТекСтрокаНачисление.ВидНачисления; //#6576
			НоваяСтрока.Сумма = ТекСтрокаНачисление.Сумма;
			НоваяСтрока.СчетСотрудника = ФинансыСервер.ПолучитьСчетСотрудника(ТекСтрокаНачисление.Сотрудник);
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") Тогда
		ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные;
		Договор = ДанныеЗаполнения.ДоговорКонтрагента;
		//Комментарий = ДанныеЗаполнения.Комментарий; //#5849
		Контрагент = ДанныеЗаполнения.Контрагент;
		Организация = ДанныеЗаполнения.Организация;
		Основание = ДанныеЗаполнения.Ссылка;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		ВалютаДокумента = ДанныеЗаполнения.Валюта;
		Счет = ДанныеЗаполнения.Организация.ОсновнойБанковскийСчет;
		
		//НазначениеПлатежа = "По " + Строка(Договор) + ". Сумма " + Формат(Сумма, "ЧДЦ=2; ЧРД=-; ЧГ=0" ) + ". Без налога (НДС)";
	
	//ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
	//	ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные;
	//	ВидОперацииРКО = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю;
	//	Договор = ДанныеЗаполнения.Ссылка;
	//	Контрагент = ДанныеЗаполнения.Контрагент;
	//	Организация = ДанныеЗаполнения.Организация;
	//	Основание = ДанныеЗаполнения.Ссылка;
	//	ВалютаДокумента = ДанныеЗаполнения.Валюта;
	//	
	//	//предложим к заполнению сумму равную сумму нашего долга на текущий момент
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	|	РасчетыПоЗаказамОстатки.СуммаОстаток
	//	|ИЗ
	//	|	РегистрНакопления.РасчетыПоЗаказам.Остатки(, Заказ = &ЗаказДоговор) КАК РасчетыПоЗаказамОстатки";
	//	Запрос.УстановитьПараметр("ЗаказДоговор", ДанныеЗаполнения.Ссылка);
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Если Выборка.Следующий() Тогда
	//		СуммаДокумента = Выборка.СуммаОстаток * -1;
	//	КонецЕсли;
	//	
	//ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Замена") Тогда
	//	ВидОперацииРКО = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю;
	//	ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные;
	//	Организация = ДанныеЗаполнения.Основание.Организация;
	//	//Комментарий = ДанныеЗаполнения.Основание.Комментарий; //#5849
	//	Контрагент = ДанныеЗаполнения.Основание.Контрагент;		
	//	Договор = ДанныеЗаполнения.Основание.ДоговорКонтрагента;
	//	ВалютаДокумента = ДанныеЗаполнения.Основание.Валюта;
	//	СуммаДокумента = ?(ДанныеЗаполнения.СуммаДокумента < 0, -ДанныеЗаполнения.СуммаДокумента, 0);
	//	Основание = ДанныеЗаполнения.Ссылка;
	//	
	//	Если СуммаДокумента > 0 И ТипЗнч(ДанныеЗаполнения.Основание) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
	//		НоваяСтрока = РаспределениеПлатежа.Добавить();
	//		НоваяСтрока.Документ = ДанныеЗаполнения.Основание;
	//		НоваяСтрока.Сумма = СуммаДокумента;
	//	КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаДоставку") Тогда
		ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные;
		Основание = ДанныеЗаполнения.Ссылка;
		Организация = ДанныеЗаполнения.Организация;
		Контрагент = ДанныеЗаполнения.Экспедитор;
		Договор = ДанныеЗаполнения.Экспедитор.ОсновнойДоговор;
		СуммаДокумента = ДанныеЗаполнения.СтоимостьДоставки;
		ВалютаДокумента = ДанныеЗаполнения.Валюта;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВозвратТовараОтПокупателя") Тогда
		ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные;
		Основание = ДанныеЗаполнения.Ссылка;
		Организация = ДанныеЗаполнения.Организация;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Договор = ДанныеЗаполнения.Контрагент.ОсновнойДоговор;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		ВалютаДокумента = ДанныеЗаполнения.Валюта;
		
	//++ №14125
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВозвратПродукции") Тогда
		
		ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные;
		Основание = ДанныеЗаполнения.Ссылка;
		Организация = ДанныеЗаполнения.Организация;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Договор = ДанныеЗаполнения.Контрагент.ОсновнойДоговор;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		ВалютаДокумента = ДанныеЗаполнения.Валюта;
		
	//-- №14125
		
	//++ №8498
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		
		ВидОперацииРКО = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ПрочееСписание;
		ВидОперацииСРС = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ПрочееСписание;
		
		Организация = ДанныеЗаполнения.Организация;
		Основание 	= ДанныеЗаполнения;
		
	//-- №8498
	КонецЕсли;
	
	Если СуммаДокумента > 0 И ЗначениеЗаполнено(Организация) Тогда
		УчитыватьНДС = УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(Организация);
		СтавкаНДС = УчетНДС.СтавкаНДСПоУмолчанию(Организация);
		СуммаНДС = УчетНДС.РассчитатьСуммуНДС(СуммаДокумента,
	                                          УчитыватьНДС, ,
	                                          УчетНДС.ПолучитьСтавкуНДС(СтавкаНДС));
	КонецЕсли;								

	ФинансыСервер.ДокументРасходаОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ВидОперацииРКО.Пустая() Тогда
		ВидОперацииРКО = Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ОплатаПоставщику;
	КонецЕсли;
	
	Если ВидОперацииСРС.Пустая() Тогда
		ВидОперацииСРС = Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ОплатаПоставщику;
	КонецЕсли;
	
	Если ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные Тогда
		СтатьяРасходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(ЭтотОбъект, ВидОперацииРКО, Ложь);
		СтатьяРасходовПоНачислению = СтатьяРасходов; //#9708
	Иначе
		СтатьяРасходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(ЭтотОбъект, ВидОперацииСРС, Ложь);
		СтатьяРасходовПоНачислению = СтатьяРасходов; //#9708
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		ДозаполнитьПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьСлужебныеРеквизиты();
	
	Автор = Пользователи.ТекущийПользователь();
	СтатусУтвержденияПлатежа = Перечисления.СтатусыУтвержденияПлатежей.НеУтвержден;
	ЖелательнаяДатаПлатежа = Дата(1, 1, 1);
	Основание = Неопределено;
	
	ДозаполнитьПоУмолчанию();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПолеСтатьяДДСОбязательно = Константы.ОбязательноеЗаполнениеСтатьиВДенежныхДокументах.Получить();	
	Если НЕ ЗначениеЗаполнено(Статья) И ПолеСтатьяДДСОбязательно Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
         	НСтр("ru = 'Не заполнена статья движения денежных средств!'"), ЭтотОбъект,
        	"Статья",,Отказ);
	КонецЕсли;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если СтатусУтвержденияПлатежа = Перечисления.СтатусыУтвержденияПлатежей.Утвержден Тогда
		Если Ссылка.СтатусУтвержденияПлатежа <> СтатусУтвержденияПлатежа Тогда 
			ОтветственныйУтвердил = Пользователи.ТекущийПользователь();
		КонецЕсли;
	Иначе
		ОтветственныйУтвердил = Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
	
	КассовыйДокумент = (ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные);
	ВидОперации = ?(КассовыйДокумент, ВидОперацииРКО, ВидОперацииСРС);
	ФинансыСервер.ДокументРасходаПередЗаписью(ЭтотОбъект, КассовыйДокумент, ВидОперации, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// регистр ДенежныеСредстваКВыплате Приход
	Движения.ДенежныеСредстваКВыплате.Записывать = Истина;
	Движение = Движения.ДенежныеСредстваКВыплате.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Заявка = Ссылка;
	Движение.Сумма  = СуммаДокумента;

КонецПроцедуры

#КонецОбласти

#Область Заполнение

Процедура ИнициализироватьСлужебныеРеквизиты()
	
	//#14828
	СозданПриИспользованииПодразделений  = Константы.ИспользоватьПодразделения.Получить();
	
КонецПроцедуры

Процедура ДозаполнитьПоУмолчанию()
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
